      *> Dipakai di FILE SECTION sebagai record descriptor
       01 ACCOUNT-RECORD.
         05 AR-ID        PIC 9(4).
         05 AR-NAME      PIC X(20).
         05 AR-BALANCE   PIC 9(9).
         05 AR-PIN       PIC 9(6).
         