       CALCULATE.
             MOVE WS-INPUT TO WS-REMAIN
             DIVIDE 50000 INTO WS-REMAIN GIVING WS-D50000
                                          REMAINDER WS-REMAIN
             DIVIDE 20000 INTO WS-REMAIN GIVING WS-D20000
                                          REMAINDER WS-REMAIN
             DIVIDE 10000 INTO WS-REMAIN GIVING WS-D10000.

             
