       01 WS-INPUT    PIC 9(8)  VALUE ZEROS.
       01 WS-CAP      PIC 9(8)  VALUE 10000000.
       01 WS-REMAIN   PIC 9(8)  VALUE ZEROS.

       01 WS-D50000   PIC 9(3)  VALUE ZEROS.
       01 WS-D20000   PIC 9(3)  VALUE ZEROS.
       01 WS-D10000   PIC 9(3)  VALUE ZEROS.

       01 WS-OUT-NUM  PIC ZZZ9.
